Revit 2027 API
View.Outline Property
The bounds of the view in paper space (in feet).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxUV Outline { get; }
Public ReadOnly Property Outline As BoundingBoxUV
	Get
public:
property BoundingBoxUV^ Outline {
	BoundingBoxUV^ get ();
}
member Outline : BoundingBoxUV with get
Property Value
BoundingBoxUV
Remarks
Returns all zeros for empty views.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace